Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The management interface is disabled when no extensions relying on it (such as the SmallRye Health or SmallRye OpenAPI extensions) are installed.
ja_jp: 管理インターフェイスに依存するエクステンション (SmallRye Health や SmallRye OpenAPI エクステンションなど) がインストールされていない場合、管理インターフェイスは無効になります。

source: The mapped properties will contain the host port that is mapped to the container port, which may be different from the container port if you're using dynamic port mapping (e.g., `- '5432'` instead of `- '7432:5432'`).
ja_jp: マッピングされたプロパティーには、コンテナーポートにマッピングされたホストポートが含まれます。動的ポートマッピング (例: `- '7432:5432'` ではなく `- '5432'`) を使用している場合、これはコンテナーポートとは異なる場合があります。

source: The mapping between the levels
ja_jp: レベル間のマッピング

source: The mapping strategy can be adjusted by setting `namingStrategy` value in the `@ConfigMapping` annotation:
ja_jp: マッピング戦略は、 `@ConfigMapping` のアノテーションで `namingStrategy` の値を設定することで調整できます。

source: The max delay (in seconds) between 2 reconnects Type: _int_
ja_jp: 2回の再接続の間の最大遅延時間（秒） Type: _int_

source: The max number of seconds to wait to determine if the connection with the broker is still established for the readiness check. After that threshold, the check is considered as failed. Type: _int_
ja_jp: readiness チェックのためにブローカーとの接続がまだ確立されているかどうかを判別するために待機する最大秒数。そのしきい値を超えると、チェックは失敗したと見なされます。 タイプ: _int_

source: The max total receiver queue size across partitions. + This setting reduces the receiver queue size for individual partitions if the total receiver queue size exceeds this value.
ja_jp: パーティション間のレシーバ・キュー・サイズの合計の最大値。 この設定により、合計レシーバ・キュー・サイズがこの値を超えた場合、個々のパーティションのレシーバ・キュー・サイズが減少します。

source: The maximum number of messages permitted in a batch.
ja_jp: バッチで許可されるメッセージの最大数。

source: The maximum number of messages to be written to Kafka concurrently. It limits the number of messages waiting to be written and acknowledged by the broker. You can set this attribute to `0` remove the limit Type: _long_
ja_jp: Kafkaに同時に書き込まれるメッセージの最大数。ブローカーが書き込みと確認を待っているメッセージの数を制限します。この属性を `0` に設定することで、制限を取り除くことができます。 Type: _long_

source: The maximum number of messages to be written to RabbitMQ concurrently; must be a positive number Type: _long_
ja_jp: RabbitMQ に同時に書き込まれるメッセージの最大数。正の数でなければなりません。 Type: _long_

source: The maximum number of outstanding/unacknowledged messages being processed by the connector at a time; must be a positive number Type: _int_
ja_jp: RabbitMQ に送信/未ackメッセージの最大数。正の数でなければなりません。 Type: _int_

source: The maximum number of pending messages across partitions. Use the setting to lower the max pending messages for each partition (`#setMaxPendingMessages(int)`) if the total number exceeds the configured value.
ja_jp: パーティション間の保留メッセージの最大数。

source: The maximum number of pipelined queries is configured with the `pipelining-limit` property:
ja_jp: パイプラインクエリーの最大数は、 `pipelining-limit` プロパティーで設定されます。

source: The maximum number of reconnection before failing. -1 means infinite retry Type: _int_
ja_jp: 失敗するまでの最大再接続回数を指定します。-1は無限再試行を意味します。 Type: _int_

source: The maximum number of seconds a JWT can be issued for use. Effectively, the difference between the expiration date of the JWT and the issued at date must not exceed this value. Setting this property to a non-positive value relaxes the requirement for the token to have a valid 'iat' (issued at) claim.
ja_jp: JWT を発行して使用できる最大秒数。実質的に、JWT の有効期限と発行日の差はこの値を超えてはなりません。このプロパティーを正以外の値に設定すると、トークンに有効な iat (発行日) クレームが必要であるという要件が緩和されます。

source: The maximum number of seconds that a JWT may be issued for use. Effectively, the difference between the expiration date of the JWT and the issued at date must not exceed this value. Setting this property to a non-positive value relaxes the requirement for the token to have a valid 'iat' (issued at) claim.
ja_jp: JWT を使用するために発行できる最大秒数。事実上、JWT の有効期限と発行日との差はこの値を超えてはなりません。このプロパティーを正でない値に設定すると、トークンが有効な 'iat' (で発行された) クレームを持つための要件が緩和されます。

source: The maximum size of a queue holding pending chunked messages. When the threshold is reached, the consumer drops pending messages to optimize memory utilization.
ja_jp: 保留中のチャンク・メッセージを保持するキューの最大サイズ。この閾値に達すると、コンシューマは保留中のメッセージを削除してメモリ使用率を最適化します。

source: The maximum size of a queue holding pending messages, i.e messages waiting to receive an acknowledgment from a broker
ja_jp: 保留メッセージ、つまりブローカーからの確認応答を待っているメッセージを保持するキューの最大サイズ。

source: The maximum size of a queue holding pending messages. For example, a message waiting to receive an acknowledgment from a https://pulsar.apache.org/docs/reference-terminology#broker[broker]. By default, when the queue is full, all calls to the `Send` and `SendAsync` methods fail **unless** you set `BlockIfQueueFull` to `true`.
ja_jp: 保留中のメッセージを保持するキューの最大サイズ。

source: The maximum size of the incoming internal queue Type: _int_
ja_jp: 受信内部キューの最大サイズ Type: _int_

source: The maximum size of the outgoing internal queue Type: _int_
ja_jp: 発信内部キューの最大サイズ Type: _int_

source: The maximum value recorded.
ja_jp: 記録された最大値。

source: The meaning of support scopes, such as `supported` and `tech-preview`, would be defined in the offering documentation by the corresponding team or organization.
ja_jp: `supported` や `tech-preview` のようなサポートスコープの意味は、対応するチームまたは組織によって提供物のドキュメントで定義されます。

source: The member name is converted to its kebab-case format
ja_jp: メンバー名はケバブケース (kebab-case) 形式に変換されます。

source: The message bundles can be used at runtime:
ja_jp: メッセージバンドルは、実行時に使用することができます:

source: The message from the `temperature-values` topic is joined with the corresponding weather station, using the topic's key (weather station id); the join result contains the data from the measurement and associated weather station message
ja_jp: `temperature-values` トピックからのメッセージは、トピックのキー (weather station id) を使用して、対応する気象観測所と結合されます

source: The message interception, and observation, still work with channels consuming the generic `Message` type, or custom payloads enabled by https://smallrye.io/smallrye-reactive-messaging/latest/concepts/converters/[converters].
ja_jp: メッセージのインターセプトと監視は、汎用の `Message` タイプを消費するチャネルや、 https://smallrye.io/smallrye-reactive-messaging/latest/concepts/converters/[コンバーター] によって有効化されたカスタムペイロードを使用する場合でも機能します。

source: The message object (of any type).
ja_jp: メッセージオブジェクト (任意のタイプ)。

source: The message object represents the data sent and can be accessed as either raw content (`String`, `JsonObject`, `JsonArray`, `Buffer` or `byte[]`) or deserialized high-level objects, which is the recommended approach.
ja_jp: メッセージオブジェクトは送信されたデータを表し、raw のコンテンツ (`String`、 `JsonObject`、 `JsonArray`、 `Buffer`、または `byte[]`) またはデシリアライズされた高レベルオブジェクトとしてアクセスできます。後者のアプローチが推奨されます。

source: The messages are only logged if the `DEBUG` level is enabled for the logger `io.quarkus.websockets.next.traffic`.
ja_jp: メッセージは、ロガー `io.quarkus.websockets.next.traffic` に対して `DEBUG` レベルが有効になっている場合にのみ記録されます。

source: The method body does not matter.
ja_jp: メソッド本体は重要ではありません。

source: The method can return:
ja_jp: メソッドは以下を返すことができます。

source: The method gets a https://vertx.io/docs/apidocs/io/vertx/ext/web/RoutingContext.html[`RoutingContext`] as a parameter. From the `RoutingContext` you can retrieve the HTTP request (using `request()`) and write the response using `response().end(...)`.
ja_jp: このメソッドは、 https://vertx.io/docs/apidocs/io/vertx/ext/web/RoutingContext.html[`RoutingContext`] をパラメーターとして取得します。 `RoutingContext` から HTTP リクエストを ( `request()` を使用して) 取得し、 `response().end(...)` を使用してレスポンスを書き込むことができます。

source: The method must accept exactly one _error_ parameter, i.e. a parameter that is assignable from `java.lang.Throwable`. The method may also accept the following parameters:
ja_jp: メソッドは、_error_ パラメーター、つまり `java.lang.Throwable` から割り当て可能なパラメーターを 1 つだけ受け入れる必要があります。 このメソッドは次のパラメーターも受け入れます。

source: The method must accept exactly one message parameter:
ja_jp: メソッドは、メッセージパラメーターを 1 つのみ受け入れる必要があります。

source: The method must be annotated with `@ClientObjectMapper`.
ja_jp: メソッドには `@ClientObjectMapper` アノテーションを付ける必要があります。

source: The method must return `void` and your Java runtime must provide support for virtual threads. Read xref:./virtual-threads.adoc[the virtual thread guide] for more details.
ja_jp: メソッドは `void` を返す必要があり、Java ランタイムは仮想スレッドのサポートを提供する必要があります。 詳細については、 xref:./virtual-threads.adoc[仮想スレッドガイド] をお読みください。

source: The method name (that can be called from js in the same way as any json-rpc service) is `generateManifests`.
ja_jp: メソッド名 (任意の json-rpc サービスと同様に js から呼び出し可能) は `generateManifests` です。

source: The method name `getAll` will be available in the Javascript
ja_jp: メソッド名 `getAll` は Javascript で使用できます。

source: The method name is used to match the property name by default.
ja_jp: メソッド名は、デフォルトでプロパティ名と一致するように使用されます。

source: The method name is used to match the property name by default. However, it is possible to specify the matching name with `TemplateExtension#matchName()`. A special constant - `TemplateExtension#ANY` - may be used to specify that the extension method matches any name. It is also possible to match the name against a regular expression specified in `TemplateExtension#matchRegex()`. In both cases, an additional string method parameter must be used to pass the property name. If both `matchName()` and `matchRegex()` are set the regular expression is used for matching.
ja_jp: メソッド名は、デフォルトではプロパティー名とのマッチングに使用されます。ただし、マッチする名前を `TemplateExtension#matchName()` で指定することは可能です。特別な定数 `TemplateExtension#ANY` を使用して、拡張メソッドが任意の名前にマッチすることを指定することができます。また、 `TemplateExtension#matchRegex()` で指定された正規表現に対して名前を一致させることも可能です。どちらの場合も、文字列メソッド・パラメーターを使用してプロパティー名を渡します。 `matchName()` と `matchRegex()` の両方が設定されている場合は、正規表現がマッチングに使用されます。

source: The method name of a mapping group acts as sub-namespace to the configurations properties.
ja_jp: マッピンググループのメソッド名は、設定プロパティのサブネームスペースとして機能します。

source: The method parameter (`book`) is created from the JSON payload automatically.
ja_jp: メソッドパラメーター( `book` )は、JSONペイロードから自動的に作成されます。

source: The method parameter is the message body. If the method returns _something_ it's the message response.
ja_jp: メソッドのパラメーターはメッセージボディです。メソッドが _何か_ を返す場合は、それがメッセージのレスポンスになります。

source: The method parameter is the message body. If the method returns _something_, it's the message response.
ja_jp: メソッドのパラメータはメッセージボディです。メソッドが _何か_ を返す場合は、それがメッセージのレスポンスとなります。

source: The method parameters can be used in the template.
ja_jp: メソッドのパラメーターはテンプレートで使用することができます。

source: The method receives each Fruit. Note that you would need a deserializer to reconstruct the Fruit instances from the Kafka records.
ja_jp: メソッドは各 Fruit を受け取ります。Kafka レコードから Fruit インスタンスを再構築するには、デシリアライザーが必要になることに注意してください。

source: The method receives the fruit instance to persist.
ja_jp: メソッドは、永続化するためにために fruit インスタンスを受け取ります。

source: The method receives the fruit instance to persist. It returns a `CompletionStage` which is used for the transaction demarcation. The transaction is committed when the return `CompletionStage` completes. In our case, it's when the message is written to Kafka.
ja_jp: メソッドは、永続化する fruit インスタンスを受け取ります。そして、トランザクション区切りに使用される `CompletionStage` を返します。トランザクションは、返された `CompletionStage` が完了するとコミットされます。この例の場合は、メッセージが Kafka に書き込まれるときになります。

source: The method receiving the `Multi` can either return another `Multi` or `void`. If the method returns a `Multi`, it does not have to subscribe to the incoming `multi`:
ja_jp: `Multi` を受け取るメソッドは、別の `Multi` または `void` を返すことができます。 メソッドが `Multi` を返す場合、受信する `multi` をサブスクライブする必要はありません。

source: The method returns a Mutiny _stream_ (`Multi`) emitting a random temperature value every 0.5 seconds.
ja_jp: このメソッドは、0.5 秒ごとにランダムな温度値を放出する Mutiny _ストリーム_ ( `Multi` ) を返します。

source: The method returns a `@Singleton`.
ja_jp: メソッドは `@Singleton` を返します。

source: The method returns a `Uni<Void>` which completes when the mail is sent. It does not block the caller thread.
ja_jp: このメソッドは、メールが送信されたときに完了する `Uni<Void>` を返します。このメソッドは、呼び出し元のスレッドをブロックしません。

source: The method returns the result. The virtual thread terminates.
ja_jp: メソッドは結果を返します。仮想スレッドは終了します。

source: The method returns the specific type of `MeterRegistry`
ja_jp: このメソッドは、特定のタイプの `MeterRegistry` を返します。

source: The method shown in this reference guide generates a binary with DWARF debug information, runs it via `perf record` and then uses `perf script` and flame graph tooling to generate the flamegraphs. However, the `perf script` post-processing step done on this binary can appear to be slow or can show some DWARF errors.
ja_jp: このリファレンス・ガイドで紹介する方法は、DWARFのデバッグ情報を含むバイナリを生成し、 `perf record` を通して実行し、 `perf script` とフレーム・グラフ・ツールを使用してフレーム・グラフを生成します。しかし、このバイナリで行われる `perf script` の後処理ステップは、時間がかかったり、DWARF のエラーが表示されたりすることがあります。

source: The method that sends a form needs to specify multipart form data as the consumed media type, e.g.
ja_jp: フォームを送信するメソッドは、消費されたメディアタイプとしてマルチパートフォームデータを指定する必要があります。例えば、次のようにします。

source: The method uses the `Validator` instance to check the payload. It returns a set of violations. If this set is empty, it means the object is valid. In case of failures, the messages are concatenated and sent back to the browser.
ja_jp: このメソッドは、 `Validator` インスタンスを使用してペイロードをチェックします。このメソッドは、違反のセットを返却します。このセットが空であれば、オブジェクトが有効であることを意味します。失敗した場合は、メッセージが連結され、ブラウザに送り返されます。

source: The methods can access injected beans. Check the link:{quickstarts-blob-url}/lifecycle-quickstart/src/main/java/org/acme/lifecycle/AppLifecycleBean.java[AppLifecycleBean.java] class for details.
ja_jp: メソッドは，注入されたBeanにアクセスできます。詳細は link:{quickstarts-blob-url}/lifecycle-quickstart/src/main/java/org/acme/lifecycle/AppLifecycleBean.java[AppLifecycleBean.java] クラスを確認してください。

source: The methods can access injected beans. Check the {quickstarts-blob-url}/lifecycle-quickstart/src/main/java/org/acme/lifecycle/AppLifecycleBean.java[AppLifecycleBean.java] class for details.
ja_jp: メソッドは注入されたBeanにアクセスすることができます。詳細は {quickstarts-blob-url}/lifecycle-quickstart/src/main/java/org/acme/lifecycle/AppLifecycleBean.java[AppLifecycleBean.java] クラスを確認してください。

source: The metric endpoints will be only accessible with the <<basic-auth>>.
ja_jp: メトリクスエンドポイントには、<<basic-auth>> を使用してのみアクセス可能です。

source: The metrics contain both the Redis connection pool metrics (`redis_pool_*`) and the metrics about the command execution (`redis_commands_*`) such as the number of command, successes, failures, and durations.
ja_jp: メトリクスには、Redis接続プールのメトリクス（ `redis_pool_*` ）と、コマンド実行に関するメトリクス（ `redis_commands_*` ）（コマンド数、成功、失敗、継続時間など）の両方が含まれています。

source: The metrics contain both the service discovery (`stork_service_discovery_*`) and the metrics about the service selection (`stork_service_selection_*`) such as the number of service instances, failures, and durations.
ja_jp: メトリックスには、サービスディスカバリー ( `stork_service_discovery_*` ) とサービスセレクション ( `stork_service_selection_*` ) に関するメトリックス (サービスインスタンス数、失敗数、持続時間など) の両方が含まれます。

source: The metrics endpoint is exposed on a separate management port (8182), isolated from the main API port (8181), following Kubernetes best practices:
ja_jp: メトリクスエンドポイントは、Kubernetesのベストプラクティスに従い、メインAPIポート (8181) とは分離された、別の管理ポート (8182) で公開されます。

source: The metrics functionality is experimental and *off* by default. You will need to activate it by setting:
ja_jp: メトリクス機能は実験的なものであり、デフォルトで *off* になっています。これは、次の設定で有効にする必要があります。

source: The metrics functionality is tech preview and *off* by default. You will need to activate it by setting:
ja_jp: メトリクス機能はテクニカルプレビューであり、デフォルトで *off* になっています。これを有効にするには、次の設定を行う必要があります。

source: The metrics produced with each framework follow different APIs and the mapping is not 1:1.
ja_jp: 各フレームワークで生成されるメトリクスは異なる API に従うため、マッピングは 1:1 ではありません。

source: The micrometer extension will make a best effort at representing URIs containing path parameters in templated form. Using examples from above, a request to `http://localhost:8080/example/prime/7919` should appear as an attribute of `http_server_requests_seconds_*` metrics with a value of `uri=/example/prime/{number}`.
ja_jp: Micrometer エクステンションは、パスパラメーターを含む URI をテンプレート形式で表現するために最善を尽くします。 上記の例を使用すると、`http://localhost:8080/example/prime/7919` へのリクエストは、`http_server_requests_seconds_*` メトリクスの属性として、 `uri=/example/prime/{number}` という値で表示される必要があります。

source: The minimum Java version required for this extension to run. Will be generated based on the `maven.compiler.release` used in the build.
ja_jp: このエクステンションの実行に必要な最小 Java バージョン。ビルドで使用される `maven.compiler.release` に基づいて生成されます。

source: The minimum amount of data the server should return for a fetch request. The default setting of 1 byte means that fetch requests are answered as soon as a single byte of data is available or the fetch request times out waiting for data to arrive. Type: _int_
ja_jp: フェッチ・リクエストに対してサーバーが返すべきデータの最小量。デフォルトの1バイトの設定は、1バイトのデータが利用可能になるか、データの到着を待ってフェッチリクエストがタイムアウトするとすぐにフェッチリクエストに応答することを意味します。 Type: _int_

source: The minimum log level is a build-time configuration option that sets the floor level for which Quarkus generates supporting code. This enables further build-time optimizations, such as dead code elimination when building a native image.
ja_jp: 最小ログレベルは、Quarkus がサポートコードを生成する基準となるフロアレベルを設定するビルド時設定オプションです。これにより、ネイティブイメージのビルド時のデッドコード削除など、さらなるビルド時の最適化が可能になります。

source: The minimum logging level to use to configure the category named `<category-name>`. The quotes are necessary.
ja_jp: `<category-name>` という名前のカテゴリを設定するために使用する最小ロギングレベル。クオートが必要です。

source: The minimum value recorded.
ja_jp: 記録された最小値。

source: The misfire policy can be configured for each job. `task-job` is the identity of the job.
ja_jp: 誤動作防止ポリシーは、ジョブごとに設定できます。 `task-job` はジョブの ID です

source: The mission of the Eclipse Adoptium Top-Level Project is to produce high-quality runtimes and associated technology for use within the Java ecosystem. Eclipse Adoptium also provides artifacts including open-source infrastructure as code, a comprehensive continuous integration build and test farm, and extensive quality assurance tests. These artifacts may be used by Eclipse Adoptium projects and other runtime technology builders to ensure the provision of secure, Java SE TCK-tested and compliant, production-ready runtimes.
ja_jp: Eclipse Adoptium Top-Level Projectの使命は、Javaエコシステム内で使用される高品質のランタイムと関連技術を生産することです。Eclipse Adoptiumはまた、コードとしてのオープンソースのインフラストラクチャ、包括的な継続的統合ビルドとテストファーム、および広範な品質保証テストを含む成果物を提供します。これらの成果物は、Eclipse Adoptiumプロジェクトや他のランタイム技術構築者が、安全で、Java SE TCKでテストされ、準拠した、生産可能なランタイムを確実に提供するために使用することができます。

source: The mock event server is also started for `@NativeImageTest` and `@QuarkusIntegrationTest` tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
ja_jp: 模擬イベントサーバーは、 `@NativeImageTest` および `@QuarkusIntegrationTest` テストでも起動されるため、ネイティブバイナリーでも機能します。これはすべて、Docker のオーバーヘッドなしで、SAM CLI ローカルテストと同様の機能を提供します。

source: The mock event server is also started for `@NativeImageTest` unit tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
ja_jp: モックイベントサーバは `@NativeImageTest` のユニットテストでも起動するので、 ネイティブバイナリでも動作します。このように、同様の機能をSAM CLI のローカルテストに対して Docker のオーバーヘッドなしで提供します。

source: The mock event server is also started for `@QuarkusIntegrationTest` tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
ja_jp: モックイベントサーバは `@QuarkusIntegrationTest` のテストでも起動されるので、ネイティブバイナリでも動作します。このように、SAM CLI のローカルテストと同様の機能を、Docker のオーバーヘッドなしに提供します。

source: The mock event server is also started for `@QuarkusIntegrationTest` tests, so it will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
ja_jp: モックイベントサーバは `@QuarkusIntegrationTest` のテストでも起動されるので、ネイティブバイナリでも動作します。このように、SAM CLI のローカルテストと同様の機能を、Docker のオーバーヘッドなしに提供します。

source: The mock is just an empty shell without any actual configuration values.
ja_jp: モックは、実際の設定値を持たない空のシェルに過ぎません。

source: The model above is only a subset of the fields provided by the service, but it suffices for the purposes of this guide.
ja_jp: 上記のモデルは、サービスによって提供されるフィールドのサブセットに過ぎませんが、このガイドの目的には十分です。

source: The model is based on the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.adoc#eclipse-microprofile-lra[Eclipse MicroProfile LRA specification]. The approach is for the developer to annotate a business method with a Java annotation (https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`]). When such a method is called, an LRA context is created (if one is not already present) which is passed along with subsequent JAX-RS invocations until a method is reached which also contains an `@LRA` annotation with an attribute that indicates that the LRA should be closed or cancelled. The default is for the LRA to be closed in the same method that started the LRA (which itself may have propagated the context during method execution). The JAX-RS resource indicates that it wishes to participate in the interaction by, minimally, marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`] annotation. If the context is later cancelled then this compensate action is guaranteed to be called even in the presence of failures and is the trigger for the resource to compensate for any activities it performed in the context of the LRA. This guarantee enables services to operate reliably with the assurance of eventual consistency (when all compensation activities have ran to completion). The participant can ask to be reliably notified when the LRA it is participating in is closed by marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`] annotation. In this way cancelling an LRA causes all participants to be notified via their Compensate callback and closing an LRA causes all participants to be notified via their Complete callback (if they have one). Other annotations for controlling participants are documented in the https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc].
ja_jp: このモデルは link:https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.adoc#eclipse-microprofile-lra[Eclipse MicroProfile LRA 仕様] に基づいています。 このアプローチは、開発者がビジネス・メソッドに Java アノテーション ( link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@LRA] ).そのようなメソッドが呼び出されると、LRA コンテキストが作成され (まだ存在しない場合)、そのコンテキストは、LRA をクローズまたはキャンセルする必要があることを示す属性を持つ `@LRA` アノテーションを含むメソッドに到達するまで、後続の JAX-RS 呼び出しと共に渡されます。デフォルトでは、LRA は LRA を開始したのと同じメソッドで閉じられます（メソッド実行中にコンテキストが伝播される可能性があります）。JAX-RSリソースは、最低限、メソッドの1つに link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@Compensate] アノテーションを付けることです。コンテキストが後でキャンセルされた場合、このcompensateアクションは失敗があっても呼び出されることが保証され、リソースがLRAのコンテキストで実行したアクティビティを補償するトリガーとなります。この保証により、（すべての補償アクティビティが完了したときに）最終的な一貫性が保証され、サービスを確実に動作させることができます。参加者は、メソッドの1つに link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@Complete] アノテーションを付けることで。このように、LRAをキャンセルすると、Compensateコールバックを介してすべての参加者に通知され、LRAを閉じると、Completeコールバック（ある場合）を介してすべての参加者に通知されます。参加者を制御するためのその他のアノテーションについては、 link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc] に記載されています。
